## `terraform/scheduling`
#### Terraform Format and Style 🖌`'No changes needed.'`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.custom_lambda.module.user_action_filter_function.local_file.archive_plan[0]: Refreshing state... [id=421827469ade4a6f146fa8ac3fc4b3f8da27703b]
module.custom_lambda.module.user_action_filter_function.null_resource.archive[0]: Refreshing state... [id=1216790831001021641]
data.aws_vpc.myvpc: Reading...
module.custom_ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster]
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/user-action-filter-function]
data.aws_iam_role.task_execution_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_cloudwatch.aws_cloudwatch_log_group.firelens: Refreshing state... [id=/aws/ecs/minecraft-firelens-logs]
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
data.aws_security_group.fargate_sg: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_role.task_role: Reading...
data.aws_sns_topic.my_sns: Reading...
module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0]: Refreshing state... [id=user-action-filter-function]
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-test-role]
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-test-ecs_tasks_execution-role]
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
data.aws_sns_topic.my_sns: Read complete after 0s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function]
data.aws_security_group.fargate_sg: Read complete after 0s [id=sg-07934f64784cd1b97]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=user-action-filter-function-20240622002916278000000003]
module.custom_ecs.aws_ecs_task_definition.main: Refreshing state... [id=minecraft-test]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1875139620]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function-logs]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=user-action-filter-function-20240622002916278000000002]
module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0]: Refreshing state... [id=user-action-filter-function]
data.aws_vpc.myvpc: Read complete after 1s [id=vpc-080b3749ba65ae3d7]
data.aws_subnets.my_subnets: Reading...
module.custom_nlb.module.nlb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240622002914621800000001/c98bb00e6bf43eb6]
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
module.custom_nlb.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/1cfe96fbd34908e2]
module.custom_lambda.aws_lambda_permission.log_permission: Refreshing state... [id=terraform-20240622002930523100000005]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"]: Refreshing state... [id=cwlsf-384885153]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"]: Refreshing state... [id=cwlsf-384885153]
module.custom_ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service]
module.custom_nlb.null_resource.send_slack_notification: Refreshing state... [id=810362777898477104]
module.custom_nlb.module.nlb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/1cfe96fbd34908e2/df8279766141f2e0]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check: Refreshing state... [id=minecraft-test-targetgroup_healthy]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization: Refreshing state... [id=minecraft-test-cpu_utilization]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count: Refreshing state... [id=minecraft-test-task_running_count]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization: Refreshing state... [id=minecraft-test-memory_utilization]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "user-action-filter-function"
      ~ last_modified                  = "2024-06-22T00:29:24.896+0000" -> "2024-06-22T00:29:30.608+0000"
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.custom_ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test:151" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "minecraft-test" -> (known after apply)
      ~ revision                 = 151 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>